Revit.Elements.Tag.SetLeaderElbow(Autodesk.DesignScript.Geometry.Point)
Set the position of the elbow of the tag's leader
location:
Returns:

Revit.Elements.Tag.GetLeaderEndCondition
Get Tag's leaderEnd condition

Revit.Elements.Tag.SetLeaderEndCondition(System.String)
Set Tag's LeaderEnd condition
leaderEndCondition:
Returns: